from .异常类 import (
    调试输出, 算术错误, 断言错误, 属性错误, 基础异常, 阻塞IO错误, 管道破裂错误, 缓冲区错误, 字节警告, 子进程错误, 连接中止错误, 连接错误, 连接被拒绝错误, 连接重置错误, 弃用警告, 
    文件结束错误, 环境错误, 异常, 文件已存在错误, 文件未找到错误, 浮点错误, 未来警告, 生成器退出, IO错误, 导入错误, 导入警告, 缩进错误, 索引错误, 中断错误, 是一个目录错误, 键错误, 
    键盘中断, 查找错误, 内存错误, 模块未找到错误, 名称错误, 不是一个目录错误, 尚未实现错误, 操作系统错误, 溢出错误, 待弃用警告, 权限错误, 进程查找错误, 递归错误, 引用错误, 资源警告, 
    运行时错误, 运行时警告, 停止异步迭代, 停止迭代, 语法错误, 语法警告, 系统错误, 系统退出, 制表符错误, 超时错误, 类型错误, 未绑定本地错误, Unicode解码错误, Unicode编码错误, Unicode错误, 
    Unicode翻译错误, Unicode警告, 用户警告, 值错误, 警告, Windows错误, 除零错误
)

from .异常类 import(
    构建类, 导入, 加载器, 绝对值, 全部, 任一, ASCII码, 二进制, 布尔值, 断点, 字节数组, 字节, 可调用, 字符, 
    类方法, 编译, 复数, 版权, 信誉, 删除属性, 字典, 目录, 除余, 枚举, 评估, 执行, 退出, 过滤, 浮点数, 格式化, 冻结集合, 获取属性, 全局变量, 有属性, 哈希, 帮助, 十六进制, ID, 输入, 整数, 
    实例, 子类, 迭代, 长度, 许可证, 列表, 局部变量, 映射, 最大值, 内存视图, 最小值, 下一个, 对象, 八进制, 打开, 序号, 幂, 属性, 退出, 范围, 表示, 反转, 四舍五入, 集合, 设置属性, 切片, 排序,
     静态方法, 字符串, 求和, 超类, 元组, 类型, 变量, 压缩
)

from .时间类 import (
    获取当前时间戳,格式化时间戳,暂停,获取当前本地时间,获取当前UTC时间,格式化时间
)

from .访问类 import (
    网页_访问
)

from .json类 import Json类

from .快速文本类 import(
    到大写字母,字数到位置,到小写字母,删首空格,删尾空格,删除全部空格,写出到文件
)