import re

def 到大写字母(要操作的文本, 起始位置=None, 转换字母数=None):
    # 我是人才 其实不应该这样写的
    缓冲区长度 = len(要操作的文本)
    偏移 = 1
    # 判断
    if 起始位置 is None:
        起始位置 = 1

    # 判断转换字母数是否为空
    if 转换字母数 is None:
        转换字母数 = len(要操作的文本) - 起始位置 + 1
    偏移 = 起始位置 - 1

    # 循环处理
    for _ in range(转换字母数):
        if 偏移 >= 缓冲区长度:
            break
        if ord(要操作的文本[偏移]) > 128:
            偏移 += 2
        else:
            if 96 < ord(要操作的文本[偏移]) < 123:
                要操作的文本 = 要操作的文本[:偏移] + chr(ord(要操作的文本[偏移]) & 95) + 要操作的文本[偏移 + 1:]
            偏移 += 1
    return 要操作的文本

def 字数到位置(要操作的文本, 字数):
    偏移 = 1
    缓冲区长度 = len(要操作的文本)

    for _ in range(字数 - 1):
        if 偏移 > 缓冲区长度:
            break
        if ord(要操作的文本[偏移 - 1]) > 128:
            偏移 += 2
        else:
            偏移 += 1
    return 偏移

def 到小写字母(要操作的文本, 起始位置=None, 转换字母数=None):
    缓冲区长度 = len(要操作的文本)
    偏移 = 0
    if 起始位置 is None:
        起始位置 = 1
    偏移 = 字数到位置(要操作的文本, 起始位置) - 1

    if 转换字母数 is None:
        转换字母数 = 缓冲区长度 - 偏移

    # 转换字母
    for _ in range(转换字母数):
        if 偏移 >= 缓冲区长度:
            break
        if ord(要操作的文本[偏移]) > 128:
            偏移 += 2
        elif 64 < ord(要操作的文本[偏移]) < 91:
            缓冲区列表 = list(要操作的文本)
            缓冲区列表[偏移] = chr(ord(要操作的文本[偏移]) | 32)
            要操作的文本 = ''.join(缓冲区列表)
            偏移 += 1
        else:
            偏移 += 1
    return 要操作的文本

def 删首空格(要操作的文本):
    # 使用lstrip方法 左
    删除空格后的文本 = 要操作的文本.lstrip(' ')
    return 删除空格后的文本

def 删尾空格(要操作的文本):
    # 使用rstrip方法 右
    删除空格后的文本 = 要操作的文本.rstrip(' ')
    return 删除空格后的文本

def 删除全部空格(要操作的文本): 
    # 使用正则表达 全部
    删除空格后的文本 = re.sub(r'\s+', '', 要操作的文本)
    return 删除空格后的文本

def 写出到文件(文件名):
    内存内容 = "这里是要写入文件的内容"
    with open(文件名, 'wb') as 文件句柄:
        文件句柄.seek(0)
        文件句柄.write(内存内容.encode('utf-8')) 
    return True